areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_irq-d.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/**
 * @file    p33c_irq-d.h
 * @see     p33c_irq.h
 * @brief   Interrupt Controller SFR abstraction data type declarations header file
 * @author  M91406
 * @date    September 26, 2022
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef P33C_IRQ_SFR_DECLARATIONS_H
#define	P33C_IRQ_SFR_DECLARATIONS_H

// Include standard header files
#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h> // include standard integer data types
#include <stdbool.h> // include standard boolean data types
#include <stddef.h> // include standard definition data types

// Number of ISR register blocks
#define P33C_IFS_SFR_COUNT  13  ///< Number of interrupt flag register blocks per SFR unit
#define P33C_IEC_SFR_COUNT  13  ///< Number of interrupt enable register blocks per SFR unit
#define P33C_IPC_SFR_COUNT  49  ///< Number of interrupt priority register blocks per SFR unit

#define P33C_SFR_BLOCK_OFFSET 0x0010 // Offset between IFS and IEC as well as between IEC and IPC register blocks

// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// Special register masking for small pin-count devices
// of family dsPIC33CKxxMP10x
#if defined (IFS10) || defined (IFS11) || defined (IFS12) || defined (IFS13) || defined (IFS14) || defined (IFS15)  

    #ifndef IFS9
        // Declaring dummy-variables redirecting calls 
        // to this interrupt flag register to a safe 
        // memory address
        volatile uint16_t IFS9;
    #endif

    #ifndef IEC9
        // Declaring dummy-variables redirecting calls 
        // to this interrupt flag register to a safe 
        // memory address
        volatile uint16_t IEC9;
    #endif
        
#endif
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

#if defined (IFS15)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8, &IFS9, &IFS10, &IFS11, &IFS12, &IFS13, &IFS14, &IFS15
};
#elif defined (IFS14)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8, &IFS9, &IFS10, &IFS11, &IFS12, &IFS13, &IFS14
};
#elif defined (IFS13)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8, &IFS9, &IFS10, &IFS11, &IFS12, &IFS13
};
#elif defined (IFS12)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8, &IFS9, &IFS10, &IFS11, &IFS12
};
#elif defined (IFS11)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8, &IFS9, &IFS10, &IFS11
};
#elif defined (IFS10)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8, &IFS9, &IFS10
};
#elif defined (IFS9)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8, &IFS9
};
#elif defined (IFS8)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7,
        &IFS8
};
#elif defined (IFS7)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6, &IFS7
};
#elif defined (IFS6)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5, &IFS6
};
#elif defined (IFS5)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4, &IFS5
};
#elif defined (IFS4)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3, &IFS4
};
#elif defined (IFS3)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2, &IFS3
};
#elif defined (IFS2)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1, &IFS2
};
#elif defined (IFS1)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0, &IFS1
};
#elif defined (IFS0)
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[]={
        &IFS0
};
#else
static volatile const __attribute__((unused)) uint16_t* p33c_Ifs_Handles[0];
#pragma message "-- no interrupt status flag bit registers declared for selected device"
#endif

#if defined (IEC15)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8, &IEC9, &IEC10, &IEC11, &IEC12, &IEC13, &IEC14, &IEC15
};
