areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_irq-d.h
#elif defined (IEC14)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8, &IEC9, &IEC10, &IEC11, &IEC12, &IEC13, &IEC14
};
#elif defined (IEC13)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8, &IEC9, &IEC10, &IEC11, &IEC12, &IEC13
};
#elif defined (IEC12)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8, &IEC9, &IEC10, &IEC11, &IEC12
};
#elif defined (IEC11)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8, &IEC9, &IEC10, &IEC11
};
#elif defined (IEC10)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8, &IEC9, &IEC10
};
#elif defined (IEC9)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8, &IEC9
};
#elif defined (IEC8)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7,
        &IEC8
};
#elif defined (IEC7)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6, &IEC7
};
#elif defined (IEC6)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5, &IEC6
};
#elif defined (IEC5)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4, &IEC5
};
#elif defined (IEC4)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3, &IEC4
};
#elif defined (IEC3)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2, &IEC3
};
#elif defined (IEC2)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1, &IEC2
};
#elif defined (IEC1)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0, &IEC1
};
#elif defined (IEC0)
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[]={
        &IEC0
};
#else
static volatile const __attribute__((unused)) uint16_t* p33c_Iec_Handles[0];
#pragma message "-- no interrupt enable registers declared for selected device"
#endif

#ifndef P33C_ISR_MODULE_s     

    /***********************************************************************************
     * @addtogroup  p33c-pral-irq-inheritance
     * @extends     P33C_ISR_MODULE_s 
     * @{
     */

    /** 
     * @brief Interrupt Flag Bit Register #0 inherited from device header file
     */
    union IFS0_u {
        struct tagIFS0BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS0: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #1 inherited from device header file
     */
    union IFS1_u {
        struct tagIFS1BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS1: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #2 inherited from device header file
     */
    union IFS2_u {
        struct tagIFS2BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS2: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #3 inherited from device header file
     */
    union IFS3_u {
        struct tagIFS3BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS3: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #4 inherited from device header file
     */
    union IFS4_u {
        struct tagIFS4BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS4: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #5 inherited from device header file
     */
    union IFS5_u {
        struct tagIFS5BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS5: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #6 inherited from device header file
     */
    union IFS6_u {
        struct tagIFS6BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS6: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #7 inherited from device header file
     */
    union IFS7_u {
        struct tagIFS7BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS7: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #8 inherited from device header file
     */
    union IFS8_u {
        struct tagIFS8BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS8: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #9 inherited from device header file
     */
    union IFS9_u {
        #ifdef IFS9
        struct tagIFS9BITS bits; // Register bit-field
        #else
        unsigned : 16;  // (not implemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS9: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #10 inherited from device header file
     */
    union IFS10_u {
        struct tagIFS10BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS10: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #11 inherited from device header file
     */
    union IFS11_u {
        struct tagIFS11BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS11: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #12 inherited from device header file
     */
    union IFS12_u {
        #ifdef tagIFS12BITS
        struct tagIFS12BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS12: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #13 inherited from device header file
     */
    union IFS13_u {
        #ifdef tagIFS13BITS
        struct tagIFS13BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS13: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #14 inherited from device header file
     */
    union IFS14_u {
        #ifdef tagIFS14BITS
        struct tagIFS14BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS14: IFSx STATUS REGISTER

    /** 
     * @brief Interrupt Flag Bit Register #15 inherited from device header file
     */
    union IFS15_u {
        #ifdef tagIFS15BITS
        struct tagIFS15BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IFS15: IFSx STATUS REGISTER

    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    /** 
     * @brief Interrupt Enable Bit Register #0 inherited from device header file
     */
    union IEC0_u {
        struct tagIEC0BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC0: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #1 inherited from device header file
     */
    union IEC1_u {
        struct tagIEC1BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC1: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #2 inherited from device header file
     */
    union IEC2_u {
        struct tagIEC2BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC2: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #3 inherited from device header file
     */
    union IEC3_u {
        struct tagIEC3BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC3: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #4 inherited from device header file
     */
    union IEC4_u {
        struct tagIEC4BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC4: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #5 inherited from device header file
     */
    union IEC5_u {
        struct tagIEC5BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC5: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #6 inherited from device header file
     */
    union IEC6_u {
        struct tagIEC6BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC6: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #7 inherited from device header file
     */
    union IEC7_u {
        struct tagIEC7BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC7: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #8 inherited from device header file
     */
    union IEC8_u {
        struct tagIEC8BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC8: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #9 inherited from device header file
     */
    union IEC9_u {
        #ifdef IEC9
        struct tagIEC9BITS bits; // Register bit-field
        #else
        unsigned : 16;  // (not implemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC9: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #10 inherited from device header file
     */
    union IEC10_u {
        struct tagIEC10BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC10: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #11 inherited from device header file
     */
    union IEC11_u {
        struct tagIEC11BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC11: IECx ENABLE REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #12 inherited from device header file
     */
    union IEC12_u {
        #ifdef tagIEC12BITS
        struct tagIEC12BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC12: IECx ENABLE REGISTER
    
    /** 
     * @brief Interrupt Enable Bit Register #13 inherited from device header file
     */
    union IEC13_u {
        #ifdef tagIEC13BITS
        struct tagIEC13BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC13: IECx ENABLE REGISTER
    
    /** 
     * @brief Interrupt Enable Bit Register #14 inherited from device header file
     */
    union IEC14_u {
        #ifdef tagIEC14BITS
        struct tagIEC14BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC14: IECx ENABLE REGISTER
    
    /** 
     * @brief Interrupt Enable Bit Register #15 inherited from device header file
     */
    union IEC15_u {
        #ifdef tagIEC15BITS
        struct tagIEC15BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IEC15: IECx ENABLE REGISTER
    
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    /** 
     * @brief Interrupt Enable Bit Register #0 inherited from device header file
     */
    union IPC0_u {
        struct tagIPC0BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC0: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #1 inherited from device header file
     */
    union IPC1_u {
        struct tagIPC1BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC1: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #2 inherited from device header file
     */
    union IPC2_u {
        struct tagIPC2BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC2: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #3 inherited from device header file
     */
    union IPC3_u {
        struct tagIPC3BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC3: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #4 inherited from device header file
     */
    union IPC4_u {
        struct tagIPC4BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC4: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #5 inherited from device header file
     */
    union IPC5_u {
        struct tagIPC5BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC5: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #6 inherited from device header file
     */
    union IPC6_u {
        struct tagIPC6BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC6: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #7 inherited from device header file
     */
    union IPC7_u {
        #ifdef tagIPC7BITS
        struct tagIPC7BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC7: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #8 inherited from device header file
     */
    union IPC8_u {
        struct tagIPC8BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC8: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #9 inherited from device header file
     */
    union IPC9_u {
        struct tagIPC9BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC9: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #10 inherited from device header file
     */
    union IPC10_u {
        struct tagIPC10BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC10: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #11 inherited from device header file
     */
    union IPC11_u {
        struct tagIPC11BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC11: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #12 inherited from device header file
     */
    union IPC12_u {
        struct tagIPC12BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC12: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #13 inherited from device header file
     */
    union IPC13_u {
        #ifdef tagIPC13BITS
        struct tagIPC13BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC13: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #14 inherited from device header file
     */
    union IPC14_u {
        #ifdef tagIPC14BITS
        struct tagIPC14BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC14: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #15 inherited from device header file
     */
    union IPC15_u {
        struct tagIPC15BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC15: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #16 inherited from device header file
     */
    union IPC16_u {
        struct tagIPC16BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC16: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #17 inherited from device header file
     */
    union IPC17_u {
        struct tagIPC17BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC17: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #18 inherited from device header file
     */
    union IPC18_u {
        struct tagIPC18BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC18: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #19 inherited from device header file
     */
    union IPC19_u {
        struct tagIPC19BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC19: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #20 inherited from device header file
     */
    union IPC20_u {
        struct tagIPC20BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC20: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #21 inherited from device header file
     */
    union IPC21_u {
        struct tagIPC21BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC21: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #22 inherited from device header file
     */
    union IPC22_u {
        struct tagIPC22BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC22: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #23 inherited from device header file
     */
    union IPC23_u {
        struct tagIPC23BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC23: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #24 inherited from device header file
     */
    union IPC24_u {
        struct tagIPC24BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC24: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #25 inherited from device header file
     */
    union IPC25_u {
        struct tagIPC25BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC25: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #26 inherited from device header file
     */
    union IPC26_u {
        #ifdef tagIPC26BITS
        struct tagIPC26BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC26: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #27 inherited from device header file
     */
    union IPC27_u {
        #ifdef tagIPC27BITS
        struct tagIPC27BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC27: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #28 inherited from device header file
     */
    union IPC28_u {
        struct tagIPC28BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC28: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #29 inherited from device header file
     */
    union IPC29_u {
        struct tagIPC29BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC29: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #30 inherited from device header file
     */
    union IPC30_u {
        struct tagIPC30BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC30: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #31 inherited from device header file
     */
    union IPC31_u {
        struct tagIPC31BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC31: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #32 inherited from device header file
     */
    union IPC32_u {
        struct tagIPC32BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC32: IPCx PRIORITY REGISTER

