areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_irq-d.h
    /** 
     * @brief Interrupt Enable Bit Register #33 inherited from device header file
     */
    union IPC33_u {
        #ifdef tagIPC33BITS
        struct tagIPC33BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC33: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #34 inherited from device header file
     */
    union IPC34_u {
        #ifdef tagIPC34BITS
        struct tagIPC34BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC34: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #35 inherited from device header file
     */
    union IPC35_u {
        struct tagIPC35BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC35: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #36 inherited from device header file
     */
    union IPC36_u {
        struct tagIPC36BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC36: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #37 inherited from device header file
     */
    union IPC37_u {
        #ifdef IPC37
        struct tagIPC37BITS bits; // Register bit-field
        #else
        unsigned : 16;  // (not implemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC37: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #38 inherited from device header file
     */
    union IPC38_u {
        #ifdef IPC38
        struct tagIPC38BITS bits; // Register bit-field
        #else
        unsigned : 16;  // (not implemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC38: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #39 inherited from device header file
     */
    union IPC39_u {
        #ifdef tagIPC39BITS
        struct tagIPC39BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC39: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #40 inherited from device header file
     */
    union IPC40_u {
        #ifdef tagIPC40BITS
        struct tagIPC40BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC40: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #41 inherited from device header file
     */
    union IPC41_u {
        #ifdef tagIPC41BITS
        struct tagIPC41BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC41: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #42 inherited from device header file
     */
    union IPC42_u {
        struct tagIPC42BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC42: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #43 inherited from device header file
     */
    union IPC43_u {
        struct tagIPC43BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC43: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #44 inherited from device header file
     */
    union IPC44_u {
        struct tagIPC44BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC44: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #45 inherited from device header file
     */
    union IPC45_u {
        struct tagIPC45BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC45: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #46 inherited from device header file
     */
    union IPC46_u {
        #ifdef tagIPC46BITS
        struct tagIPC46BITS bits; // Register bit-field
        #else
        uint16_t : 16;            // (unimplemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC46: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #47 inherited from device header file
     */
    union IPC47_u {
        struct tagIPC47BITS bits; // Register bit-field
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC47: IPCx PRIORITY REGISTER

    /** 
     * @brief Interrupt Enable Bit Register #47 inherited from device header file
     */
    union IPC48_u {
        #ifdef IPC48
        struct tagIPC48BITS bits; // Register bit-field
        #else
        unsigned : 16;  // (not implemented)
        #endif
        uint16_t value; // 16-bit wide register value
    } __attribute__((packed)); // IPC48: IPCx PRIORITY REGISTER
    
    /** @} */ // end of inheritance declarations **************************************
    
    typedef union IFS0_u  IFS0_t;  // IFS0:  IFSx STATUS BIT REGISTER
    typedef union IFS1_u  IFS1_t;  // IFS1:  IFSx STATUS BIT REGISTER
    typedef union IFS2_u  IFS2_t;  // IFS2:  IFSx STATUS BIT REGISTER
    typedef union IFS3_u  IFS3_t;  // IFS3:  IFSx STATUS BIT REGISTER
    typedef union IFS4_u  IFS4_t;  // IFS4:  IFSx STATUS BIT REGISTER
    typedef union IFS5_u  IFS5_t;  // IFS5:  IFSx STATUS BIT REGISTER
    typedef union IFS6_u  IFS6_t;  // IFS6:  IFSx STATUS BIT REGISTER
    typedef union IFS7_u  IFS7_t;  // IFS7:  IFSx STATUS BIT REGISTER
    typedef union IFS8_u  IFS8_t;  // IFS8:  IFSx STATUS BIT REGISTER
    typedef union IFS9_u  IFS9_t;  // IFS9:  IFSx STATUS BIT REGISTER
    typedef union IFS10_u IFS10_t; // IFS10: IFSx STATUS BIT REGISTER
    typedef union IFS11_u IFS11_t; // IFS11: IFSx STATUS BIT REGISTER
    typedef union IFS12_u IFS12_t; // IFS12: IFSx STATUS BIT REGISTER
    typedef union IFS13_u IFS13_t; // IFS13: IFSx STATUS BIT REGISTER
    typedef union IFS14_u IFS14_t; // IFS14: IFSx STATUS BIT REGISTER
    typedef union IFS15_u IFS15_t; // IFS15: IFSx STATUS BIT REGISTER
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    typedef union IEC0_u  IEC0_t;  // IEC0:  IECx ENABLE BIT REGISTER
    typedef union IEC1_u  IEC1_t;  // IEC1:  IECx ENABLE BIT REGISTER
    typedef union IEC2_u  IEC2_t;  // IEC2:  IECx ENABLE BIT REGISTER
    typedef union IEC3_u  IEC3_t;  // IEC3:  IECx ENABLE BIT REGISTER
    typedef union IEC4_u  IEC4_t;  // IEC4:  IECx ENABLE BIT REGISTER
    typedef union IEC5_u  IEC5_t;  // IEC5:  IECx ENABLE BIT REGISTER
    typedef union IEC6_u  IEC6_t;  // IEC6:  IECx ENABLE BIT REGISTER
    typedef union IEC7_u  IEC7_t;  // IEC7:  IECx ENABLE BIT REGISTER
    typedef union IEC8_u  IEC8_t;  // IEC8:  IECx ENABLE BIT REGISTER
    typedef union IEC9_u  IEC9_t;  // IEC9:  IECx ENABLE BIT REGISTER
    typedef union IEC10_u IEC10_t; // IEC10: IECx ENABLE BIT REGISTER
    typedef union IEC11_u IEC11_t; // IEC11: IECx ENABLE BIT REGISTER
    typedef union IEC12_u IEC12_t; // IEC12: IECx ENABLE BIT REGISTER
    typedef union IEC13_u IEC13_t; // IEC13: IECx ENABLE BIT REGISTER
    typedef union IEC14_u IEC14_t; // IEC14: IECx ENABLE BIT REGISTER
    typedef union IEC15_u IEC15_t; // IEC15: IECx ENABLE BIT REGISTER
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    typedef union IPC0_u  IPC0_t;  // IPC0:  IPCx PRIORITY BITS REGISTER
    typedef union IPC1_u  IPC1_t;  // IPC1:  IPCx PRIORITY BITS REGISTER
    typedef union IPC2_u  IPC2_t;  // IPC2:  IPCx PRIORITY BITS REGISTER
    typedef union IPC3_u  IPC3_t;  // IPC3:  IPCx PRIORITY BITS REGISTER
    typedef union IPC4_u  IPC4_t;  // IPC4:  IPCx PRIORITY BITS REGISTER
    typedef union IPC5_u  IPC5_t;  // IPC5:  IPCx PRIORITY BITS REGISTER
    typedef union IPC6_u  IPC6_t;  // IPC6:  IPCx PRIORITY BITS REGISTER
    typedef union IPC7_u  IPC7_t;  // IPC7:  IPCx PRIORITY BITS REGISTER
    typedef union IPC8_u  IPC8_t;  // IPC8:  IPCx PRIORITY BITS REGISTER
    typedef union IPC9_u  IPC9_t;  // IPC9:  IPCx PRIORITY BITS REGISTER
    typedef union IPC10_u IPC10_t; // IPC10: IPCx PRIORITY BITS REGISTER
    typedef union IPC11_u IPC11_t; // IPC11: IPCx PRIORITY BITS REGISTER
    typedef union IPC12_u IPC12_t; // IPC12: IPCx PRIORITY BITS REGISTER
    typedef union IPC13_u IPC13_t; // IPC13: IPCx PRIORITY BITS REGISTER
    typedef union IPC14_u IPC14_t; // IPC14: IPCx PRIORITY BITS REGISTER
    typedef union IPC15_u IPC15_t; // IPC15: IPCx PRIORITY BITS REGISTER
    typedef union IPC16_u IPC16_t; // IPC16: IPCx PRIORITY BITS REGISTER
    typedef union IPC17_u IPC17_t; // IPC17: IPCx PRIORITY BITS REGISTER
    typedef union IPC18_u IPC18_t; // IPC18: IPCx PRIORITY BITS REGISTER
    typedef union IPC19_u IPC19_t; // IPC19: IPCx PRIORITY BITS REGISTER
    typedef union IPC20_u IPC20_t; // IPC20: IPCx PRIORITY BITS REGISTER
    typedef union IPC21_u IPC21_t; // IPC21: IPCx PRIORITY BITS REGISTER
    typedef union IPC22_u IPC22_t; // IPC22: IPCx PRIORITY BITS REGISTER
    typedef union IPC23_u IPC23_t; // IPC23: IPCx PRIORITY BITS REGISTER
    typedef union IPC24_u IPC24_t; // IPC24: IPCx PRIORITY BITS REGISTER
    typedef union IPC25_u IPC25_t; // IPC25: IPCx PRIORITY BITS REGISTER
    typedef union IPC26_u IPC26_t; // IPC26: IPCx PRIORITY BITS REGISTER
    typedef union IPC27_u IPC27_t; // IPC27: IPCx PRIORITY BITS REGISTER
    typedef union IPC28_u IPC28_t; // IPC28: IPCx PRIORITY BITS REGISTER
    typedef union IPC29_u IPC29_t; // IPC29: IPCx PRIORITY BITS REGISTER
    typedef union IPC30_u IPC30_t; // IPC30: IPCx PRIORITY BITS REGISTER
    typedef union IPC31_u IPC31_t; // IPC31: IPCx PRIORITY BITS REGISTER
    typedef union IPC32_u IPC32_t; // IPC32: IPCx PRIORITY BITS REGISTER
    typedef union IPC33_u IPC33_t; // IPC33: IPCx PRIORITY BITS REGISTER
    typedef union IPC34_u IPC34_t; // IPC34: IPCx PRIORITY BITS REGISTER
    typedef union IPC35_u IPC35_t; // IPC35: IPCx PRIORITY BITS REGISTER
    typedef union IPC36_u IPC36_t; // IPC36: IPCx PRIORITY BITS REGISTER
    typedef union IPC37_u IPC37_t; // IPC37: IPCx PRIORITY BITS REGISTER
    typedef union IPC38_u IPC38_t; // IPC38: IPCx PRIORITY BITS REGISTER
    typedef union IPC39_u IPC39_t; // IPC39: IPCx PRIORITY BITS REGISTER
    typedef union IPC40_u IPC40_t; // IPC40: IPCx PRIORITY BITS REGISTER
    typedef union IPC41_u IPC41_t; // IPC41: IPCx PRIORITY BITS REGISTER
    typedef union IPC42_u IPC42_t; // IPC42: IPCx PRIORITY BITS REGISTER
    typedef union IPC43_u IPC43_t; // IPC43: IPCx PRIORITY BITS REGISTER
    typedef union IPC44_u IPC44_t; // IPC44: IPCx PRIORITY BITS REGISTER
    typedef union IPC45_u IPC45_t; // IPC45: IPCx PRIORITY BITS REGISTER
    typedef union IPC46_u IPC46_t; // IPC46: IPCx PRIORITY BITS REGISTER
    typedef union IPC47_u IPC47_t; // IPC47: IPCx PRIORITY BITS REGISTER
    typedef union IPC48_u IPC48_t; // IPC48: IPCx PRIORITY BITS REGISTER

    
    /***********************************************************************************
     * @ingroup p33c-pral-irq-properties
     * @struct  P33C_IFS_s
     * @extends P33C_ISR_MODULE_s
     * @brief   Abstracted set of Special Function Registers of interrupt flag bits
     * @details
     * This structure defines an abstracted set of Special Function Registers of a 
     * all interrupt status flag bit registers. Users can use this abstracted set of 
     * registers to capture register settings from or write generic register settings 
     * to a specific instance of the interrupt register set.
     * 
     **********************************************************************************/
    
    struct P33C_IFS_s {
        
        IFS0_t  IFS0;     // IFS0:  IFSx STATUS BIT REGISTER
        IFS1_t  IFS1;     // IFS1:  IFSx STATUS BIT REGISTER
        IFS2_t  IFS2;     // IFS2:  IFSx STATUS BIT REGISTER
        IFS3_t  IFS3;     // IFS3:  IFSx STATUS BIT REGISTER
        IFS4_t  IFS4;     // IFS4:  IFSx STATUS BIT REGISTER
        IFS5_t  IFS5;     // IFS5:  IFSx STATUS BIT REGISTER
        IFS6_t  IFS6;     // IFS6:  IFSx STATUS BIT REGISTER
        IFS7_t  IFS7;     // IFS7:  IFSx STATUS BIT REGISTER
        IFS8_t  IFS8;     // IFS8:  IFSx STATUS BIT REGISTER
        IFS9_t  IFS9;     // IFS9:  IFSx STATUS BIT REGISTER
        IFS10_t IFS10;    // IFS10: IFSx STATUS BIT REGISTER
        IFS11_t IFS11;    // IFS11: IFSx STATUS BIT REGISTER
        IFS12_t IFS12;    // IFS12: IFSx STATUS BIT REGISTER
        IFS13_t IFS13;    // IFS13: IFSx STATUS BIT REGISTER
        IFS14_t IFS14;    // IFS14: IFSx STATUS BIT REGISTER
        IFS15_t IFS15;    // IFS15: IFSx STATUS BIT REGISTER
        
