areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_irq-d.h
    };
    
    typedef struct P33C_IFS_s P33C_IFS_t;  ///< IFS SPECIAL FUNCTION REGISTER SET
    
    /***********************************************************************************
     * @ingroup p33c-pral-irq-properties
     * @struct  P33C_IEC_s
     * @extends P33C_ISR_MODULE_s
     * @brief   Abstracted set of Special Function Registers of interrupt enable bits
     * @details
     * This structure defines an abstracted set of Special Function Registers of a 
     * all interrupt enable bit registers. Users can use this abstracted set of 
     * registers to capture register settings from or write generic register settings 
     * to a specific instance of the interrupt register set.
     * 
     **********************************************************************************/
    
    struct P33C_IEC_s {
        
        IEC0_t  IEC0;     // IEC0:  IECx ENABLE BIT REGISTER
        IEC1_t  IEC1;     // IEC1:  IECx ENABLE BIT REGISTER
        IEC2_t  IEC2;     // IEC2:  IECx ENABLE BIT REGISTER
        IEC3_t  IEC3;     // IEC3:  IECx ENABLE BIT REGISTER
        IEC4_t  IEC4;     // IEC4:  IECx ENABLE BIT REGISTER
        IEC5_t  IEC5;     // IEC5:  IECx ENABLE BIT REGISTER
        IEC6_t  IEC6;     // IEC6:  IECx ENABLE BIT REGISTER
        IEC7_t  IEC7;     // IEC7:  IECx ENABLE BIT REGISTER
        IEC8_t  IEC8;     // IEC8:  IECx ENABLE BIT REGISTER
        IEC9_t  IEC9;     // IEC9:  IECx ENABLE BIT REGISTER
        IEC10_t IEC10;    // IEC10: IECx ENABLE BIT REGISTER
        IEC11_t IEC11;    // IEC11: IECx ENABLE BIT REGISTER
        IEC12_t IEC12;    // IEC12: IECx ENABLE BIT REGISTER
        IEC13_t IEC13;    // IEC13: IECx ENABLE BIT REGISTER
        IEC14_t IEC14;    // IEC14: IECx ENABLE BIT REGISTER
        IEC15_t IEC15;    // IEC15: IECx ENABLE BIT REGISTER
        
    };
    
    typedef struct P33C_IEC_s P33C_IEC_t;  ///< IEC SPECIAL FUNCTION REGISTER SET

    /***********************************************************************************
     * @ingroup p33c-pral-irq-properties
     * @struct  P33C_IPC_s
     * @extends P33C_ISR_MODULE_s
     * @brief   Abstracted set of Special Function Registers of interrupt priority bits
     * @details
     * This structure defines an abstracted set of Special Function Registers of a 
     * all interrupt priority bits registers. Users can use this abstracted set of 
     * registers to capture register settings from or write generic register settings 
     * to a specific instance of the interrupt register set.
     * 
     **********************************************************************************/
    
    struct P33C_IPC_s {
        
        IPC0_t  IPC0;     // IPC0:  IPCx PRIORITY BITS REGISTER
        IPC1_t  IPC1;     // IPC1:  IPCx PRIORITY BITS REGISTER
        IPC2_t  IPC2;     // IPC2:  IPCx PRIORITY BITS REGISTER
        IPC3_t  IPC3;     // IPC3:  IPCx PRIORITY BITS REGISTER
        IPC4_t  IPC4;     // IPC4:  IPCx PRIORITY BITS REGISTER
        IPC5_t  IPC5;     // IPC5:  IPCx PRIORITY BITS REGISTER
        IPC6_t  IPC6;     // IPC6:  IPCx PRIORITY BITS REGISTER
        IPC7_t  IPC7;     // IPC7:  IPCx PRIORITY BITS REGISTER
        IPC8_t  IPC8;     // IPC8:  IPCx PRIORITY BITS REGISTER
        IPC9_t  IPC9;     // IPC9:  IPCx PRIORITY BITS REGISTER
        IPC10_t IPC10;    // IPC10: IPCx PRIORITY BITS REGISTER
        IPC11_t IPC11;    // IPC11: IPCx PRIORITY BITS REGISTER
        IPC12_t IPC12;    // IPC12: IPCx PRIORITY BITS REGISTER
        IPC13_t IPC13;    // IPC13: IPCx PRIORITY BITS REGISTER
        IPC14_t IPC14;    // IPC14: IPCx PRIORITY BITS REGISTER
        IPC15_t IPC15;    // IPC15: IPCx PRIORITY BITS REGISTER
        IPC16_t IPC16;    // IPC16: IPCx PRIORITY BITS REGISTER
        IPC17_t IPC17;    // IPC17: IPCx PRIORITY BITS REGISTER
        IPC18_t IPC18;    // IPC18: IPCx PRIORITY BITS REGISTER
        IPC19_t IPC19;    // IPC19: IPCx PRIORITY BITS REGISTER
        IPC20_t IPC20;    // IPC20: IPCx PRIORITY BITS REGISTER
        IPC21_t IPC21;    // IPC21: IPCx PRIORITY BITS REGISTER
        IPC22_t IPC22;    // IPC22: IPCx PRIORITY BITS REGISTER
        IPC23_t IPC23;    // IPC23: IPCx PRIORITY BITS REGISTER
        IPC24_t IPC24;    // IPC24: IPCx PRIORITY BITS REGISTER
        IPC25_t IPC25;    // IPC25: IPCx PRIORITY BITS REGISTER
        IPC26_t IPC26;    // IPC26: IPCx PRIORITY BITS REGISTER
        IPC27_t IPC27;    // IPC27: IPCx PRIORITY BITS REGISTER
        IPC28_t IPC28;    // IPC28: IPCx PRIORITY BITS REGISTER
        IPC29_t IPC29;    // IPC29: IPCx PRIORITY BITS REGISTER
        IPC30_t IPC30;    // IPC30: IPCx PRIORITY BITS REGISTER
        IPC31_t IPC31;    // IPC31: IPCx PRIORITY BITS REGISTER
        IPC32_t IPC32;    // IPC32: IPCx PRIORITY BITS REGISTER
        IPC33_t IPC33;    // IPC33: IPCx PRIORITY BITS REGISTER
        IPC34_t IPC34;    // IPC34: IPCx PRIORITY BITS REGISTER
        IPC35_t IPC35;    // IPC35: IPCx PRIORITY BITS REGISTER
        IPC36_t IPC36;    // IPC36: IPCx PRIORITY BITS REGISTER
        IPC37_t IPC37;    // IPC37: IPCx PRIORITY BITS REGISTER
        IPC38_t IPC38;    // IPC38: IPCx PRIORITY BITS REGISTER
        IPC39_t IPC39;    // IPC39: IPCx PRIORITY BITS REGISTER
        IPC40_t IPC40;    // IPC40: IPCx PRIORITY BITS REGISTER
        IPC41_t IPC41;    // IPC41: IPCx PRIORITY BITS REGISTER
        IPC42_t IPC42;    // IPC42: IPCx PRIORITY BITS REGISTER
        IPC43_t IPC43;    // IPC43: IPCx PRIORITY BITS REGISTER
        IPC44_t IPC44;    // IPC44: IPCx PRIORITY BITS REGISTER
        IPC45_t IPC45;    // IPC45: IPCx PRIORITY BITS REGISTER
        IPC46_t IPC46;    // IPC46: IPCx PRIORITY BITS REGISTER
        IPC47_t IPC47;    // IPC47: IPCx PRIORITY BITS REGISTER
        IPC48_t IPC48;    // IPC48: IPCx PRIORITY BITS REGISTER
        
    };
    
    typedef struct P33C_IPC_s P33C_IPC_t;  ///< IEC SPECIAL FUNCTION REGISTER SET
     
    
    /***********************************************************************************
     * @ingroup p33c-pral-irq-properties
     * @struct  P33C_ISR_MODULE_s
     * @brief   Abstracted set of Special Function Registers of interrupt flag, enable and priority bits
     * @details
     * This structure defines an abstracted set of Special Function Registers of a 
     * all interrupt status flag, enable and priority bit registers. Users can use 
     * this abstracted set of registers to capture register settings from or write 
     * generic register settings to the interrupt flag/enable/priority register set.
     * 
     **********************************************************************************/

