areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_irq-d.h
    struct P33C_ISR_MODULE_s {
        P33C_IFS_t IFS;  ///< ISR STATUS FLAG BIT SPECIAL FUNCTION REGISTER SET 
        P33C_IEC_t IEC;  ///< ISR ENABLE BIT SPECIAL FUNCTION REGISTER SET
        P33C_IPC_t IPC;  ///< ISR PRIORITY BITS SPECIAL FUNCTION REGISTER SET
    };
    
    typedef struct P33C_ISR_MODULE_s P33C_ISR_MODULE_t;  ///< ISR SPECIAL FUNCTION REGISTER SET

    /*********************************************************************************
     * @ingroup p33c-pral-irq-methods
     * @brief   Gets pointer to IFS/IEC/IPC SFR set
     * @return  Pointer to interrupt flags/enable/priority special function register data object of type P33C_ISR_MODULE_t
     *  
     * @details
     *  This function returns the pointer to the IFS interrupt flags register 
     *  set in Special Function Register memory space. This pointer can be used 
     *  to directly write to/read from the Special Function Registers of the 
     *  IFS/IEC/IPC peripheral instance configuration.
     * 
     * @note
     *  To maximize code execution performance, the declared peripheral instance 
     *  index parameter is not validated. Hence, GetHandle could potentially return
     *  an invalid memory address with unclear consequences for the user firmware.
     * 
     *********************************************************************************/
    #define p33c_IsrModule_GetHandle(pInstance) (P33C_ISR_MODULE_t*)&IFS0;
    
#endif // end of P33C_ISR_MODULE_s
#endif /* End of P33C_IRQ_SFR_DECLARATIONS_H */

// __________________________
// end of file
